package JavaBasics;

// 2) Создайте переменную, присвойте ей целочисленное значение. Выведите значение на экран
public class Program2{
    public static void main(String[] args){
        int n = 5;
        System.out.print(n);
    }
    
}
