package JavaBasics;

// 3) Создайте переменную, увеличьте её на единицу несколькими способами и выведите значение на экран.
public class Program3 {
    public static void main(String[] args){
        int n = 5;
        System.out.println(++n);
        System.out.println(n+1);
        System.out.println(n++);
        System.out.println(n);
    }
}
