//5. Реализовать частотный словарь слов русского языка (на вход принимается текст любой размерности)


import java.util.*;

public class Main {
    public static void main(String[] args) {

        String text = "Зачем опять меняемся местами,\n" +
                "     зачем опять, всЈ менее нужна,\n" +
                "     плывет ко мне московскими мостами\n" +
                "     посольских переулков тишина?\n" +
                "\n" +
                "     И сызнова полет автомобильный\n" +
                "     в ночи к полупустым особнякам,\n" +
                "     как сызмала, о город нелюбимый,\n" +
                "     к изогнутым и каменным цветам.\n" +
                "\n" +
                "     И веточки невидимо трясутся,\n" +
                "     да кружится неведомо печаль:\n" +
                "     унылое и легкое распутство,\n" +
                "     отчужденности слабая печать.\n" +
                "\n" +
                "     Затем. Затем торопишься пожить.\n" +
                "     Затем, что это юмор неуместный,\n" +
                "     затем, что наши головы кружит\n" +
                "     двадцатый век, безумное спортсменство.";

    }
}