// 1. Реализовать класс обертку StringBuilder с поддержкой undo. Делегировать стандартные методы стандартному StringBUilder. Паттерн «Команда»



public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}